Tekla Open API Reference for Tekla Structures 2025
SymbolElement Properties
The SymbolElement type exposes the following members.
Properties
Name | Description
Color
 This property is the symbol color.
Height
 The symbol height (mm).
Symbol
 The symbol.
TrueColor
 The true color (rgb enabled) of the symbol.
Top
See Also
Reference
SymbolElement Class
Tekla.Structures.Drawing Namespace